#+BEGIN_SRC emacs-lisp :session python
(pyvenv-workon "qfpy")
#+END_SRC



#+BEGIN_SRC python :session python
  from sklearn.model_selection import train_test_split
  return print('fff')
#+END_SRC

#+RESULTS:



#+begin_src python
import sklearn
def foo(x):
  if x>0:
    return x+1

  else:
    return x-1

return foo(5)
#+end_src

#+RESULTS:
: 6

#+begin_src python :session  :results value

y= -1
if y>0:
  ret= 'fffhhh'
else:
  ret= 'fffgsfdgsgfd'#x-1

#ret = foo(-5)
ret
#+end_src

#+RESULTS:
: fff


#+begin_src python :session :results value
import random
if random.randint(0,10) % 2 == 0:
    "even"
else:
    "odd"
#+end_src

#+RESULTS:



#+begin_src python :session :results value
import random
if random.randint(0,10) % 2 == 0:
    ret = "even"
else:
    ret = "odd"
ret
#+end_src

#+RESULTS:
: even


#+begin_src python :results output
print("Hello, world!")
#+end_src

#+RESULTS:
: Hello, world!
